<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads 4D</string>
	<key>Identifier</key>
	<string>com.github.autopkg.jessepeterson-recipes.download.4d</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>4D</string>
		<key>PRODUCT_URL</key>
		<string>http://www.4d.com/downloads/products.html</string>
		<key>DOWNLOAD_RE</key>
		<string>(?P&lt;url&gt;http://download.4d.com/Products/Current/4D_v[0-9]+_[0-9]+/4D_v(?P&lt;version&gt;[0-9]+\.[0-9\.]+)_Mac.dmg)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_RE%</string>
				<key>url</key>
				<string>%PRODUCT_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>4D.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%pathname%/4D v*/4D.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%dmg_found_filename%</string>
				<key>requirement</key>
				<string>identifier &quot;com.4d.4d&quot; and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = &quot;37UG5W39Z2&quot;</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
