<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads ProjectLibre and imports into Munki.</string>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Input</key>
	<dict>
		<key>IDENTIFIER</key>
		<string>com.github.jessepeterson.munki.ProjectLibre</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Project Management</string>
		<key>NAME</key>
		<string>ProjectLibre</string>
		<key>SOURCEFORGE_FILE_PATTERN</key>
		<string>ProjectLibre-[0-9\.]*\.dmg</string>
		<key>SOURCEFORGE_PROJECT_ID</key>
		<string>715892</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>ProjectLibre is an open source project management software. It intends to be a complete desktop replacement for Microsoft Project. ProjectLibre runs on the Java Platform, allowing it to run on Linux, Mac OS or Windows operating systems.</string>
			<key>developer</key>
			<string>Geekpolis</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
