<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads GrandPerspective and imports into Munki.</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.GrandPerspective</string>
	<key>Identifier</key>
	<string>com.github.jessepeterson.munki.GrandPerspective</string>
	<key>Input</key>
	<dict/>
</dict>
</plist>
