<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports AnyConnect4 into Munki. You must specify an official dmg with the
	`-p path/to/dmg` option when running this recipe. Note this uses installer choices XML 
	to disable all other components BESIDES vpn.</string>
	<key>Identifier</key>
	<string>com.github.jessepeterson.munki.AnyConnect4</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AnyConnect</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Networking</string>
		<key>pkginfo</key>
		<dict>
			<key>description</key>
			<string>Cisco AnyConnect VPN software enables remote connection to VPNs for accessing internal network resources.</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Cisco Systems, Inc.</string>
			<key>unattended_install</key>
			<true/>
			<key>display_name</key>
			<string>Cisco AnyConnect</string>
			<key>blocking_applications</key>
			<array>
				<string>AnyConnect</string>
			</array>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_vpn</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_websecurity</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_fireamp</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_dart</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_posture</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_iseposture</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_nvm</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_umbrella</string>
				</dict>
			</array>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%PKG%/*.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Cisco/</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%PKG%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.keeleysam.recipes.GoogleTalkPlugin/MunkiPkginfoReceiptsEditor</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_ids_set_optional_true</key>
				<array>
					<string>com.cisco.pkg.anyconnect.websecurity</string>
					<string>com.cisco.pkg.anyconnect.dart</string>
					<string>com.cisco.pkg.anyconnect.websecurity_v2</string>
					<string>com.cisco.pkg.anyconnect.fireamp</string>
					<string>com.cisco.pkg.anyconnect.nvm_v2</string>
					<string>com.cisco.pkg.anyconnect.umbrella</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
