<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Code42 CrashPlan Platform Installer 5 for Mac</string>
	<key>Identifier</key>
	<string>com.github.autopkg.jessepeterson.download.CrashPlan</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CrashPlan</string>
		<key>CHECK_PAGE</key>
		<string>https://support.code42.com/Administrator/5/Planning_And_Installing/Code42_Platform_Installers</string>
		<key>RE_PATTERN</key>
		<string>href=\&quot;(?P&lt;url&gt;https.*/Code42CrashPlan_(?P&lt;file_version&gt;5[0-9\.]+)_Mac\.dmg)\&quot;</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%CHECK_PAGE%</string>
				<key>re_pattern</key>
				<string>%RE_PATTERN%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.VMwareTools/ImageConverter</string>
			<key>Arguments</key>
			<dict>
				<key>image_source</key>
				<string>%pathname%</string>
				<key>image_destination</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>image_format</key>
				<string>UDZO</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg/Install Code42 CrashPlan.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Code 42 Software (9YV9435DHD)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
