<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Find latest Neat from appcast and download.
	
Valid values for ARCH include:
- "Intel" (default)
- "ARM" (Apple Silicon)
</string>
	<key>Identifier</key>
	<string>com.github.jessepeterson.Neat.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Neat</string>
		<key>ARCH</key>
		<string>Intel</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(https://neat-marketing\.s3\.amazonaws\.com/support/Articles/Neat%20Desktop%20Application/NeatDesktop-[\d\.]+-%ARCH%\.dmg)"</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://support.neat.com/desktop/new-neat-desktop-application#downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Neat® Desktop.app</string>
				<key>requirement</key>
				<string>identifier "com.neat.desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = WZWUP793NV</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
