<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jessepeterson.download.iBarcoder</string>
	<key>Description</key>
	<string>Dwonloads iBarcoder.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iBarcoder</string>
		<key>url</key>
		<string>http://www.cristallight.com/Downloads/mac/ibarcoder.dmg</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
