<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jessepeterson.munki.VMwareTools</string>
	<key>Description</key>
	<string>Downloads VMware Darwin ISO</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VMwareTools</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>drivers</string>
		<key>MUNKI_CATEGORY</key>
		<string>Virtualization</string>
		<key>pkginfo</key>
		<dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>display_name</key>
			<string>VMware Tools</string>
			<key>description</key>
			<string>With the VMware Tools SVGA driver installed, Workstation supports significantly faster graphics performance.

The VMware Tools package provides support required for shared folders and for drag and drop operations.

Other tools in the package support synchronization of time in the guest operating system with time on the host, automatic grabbing and releasing of the mouse cursor, copying and pasting between guest and host, and improved mouse performance in some guest operating systems.</string>
			<key>developer</key>
			<string>VMware</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>VMwareToolsURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip.tar</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-untar</string>
			</dict>
			<key>New item</key>
			<string></string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-untar/com.vmware.fusion.tools.darwin.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>New item</key>
			<string></string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>ImageConverter</string>
			<key>Arguments</key>
			<dict>
				<key>image_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/payload/darwin.iso</string>
				<key>image_destination</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>image_format</key>
				<string>UDZO</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg/Install VMware Tools.app/Contents/Resources/VMware Tools.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: VMware, Inc. (EG7KH642X6)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>munkiimport_pkgname</key>
				<string>Install VMware Tools.app/Contents/Resources/VMware Tools.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
