<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.jessepeterson-recipes.AppStorePkg</string>
	<key>Identifier</key>
	<string>com.github.autopkg.jessepeterson-recipes.AppStorePkg.MicrosoftRemoteDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MicrosoftRemoteDesktop</string>
		<key>APP_NAME</key>
		<string>Microsoft Remote Desktop.app</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/MASapps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Remote Access</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Microsoft</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>display_name</key>
			<string>Microsoft Remote Desktop</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>description</key>
			<string>With the Microsoft Remote Desktop app, you can connect to a remote PC and your work resources from almost anywhere. Experience the power of Windows with RemoteFX in a Remote Desktop client designed to help you get your work done wherever you are.</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
</dict>
</plist>
