<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports latest Trim Enabler into Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.jessepeterson.TrimEnabler.munki</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TrimEnabler</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>APP_DESTINATION</key>
		<string>/Applications/Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Trim is must-have feature for most Solid State Drives. It increases data writing speeds as well as the lifetime of the SSD. With Trim Enabler, you can bring that feature to Mac OS X. It&apos;s as easy as flipping a switch.</string>
			<key>developer</key>
			<string>Cindori Software</string>
			<key>display_name</key>
			<string>Trim Enabler</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.TrimEnabler.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--destinationpath</string>
					<string>%APP_DESTINATION%</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
