<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>description</key>
	<string>Downloads latest NVIDIA CUDA Driver.</string>
	<key>Identifier</key>
	<string>com.github.jessepeterson.download.CUDADriver</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_OS_VERSION</key>
		<string>10.12</string>
		<key>NAME</key>
		<string>CUDADriver</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Nvidia CUDA 10.2 (toolkit and driver) was the last release to support macOS. Details:
	- https://docs.nvidia.com/cuda/archive/10.2/cuda-toolkit-release-notes/index.html#title-new-features
	- https://mjtsai.com/blog/2019/11/25/nvidia-drops-cuda-support-for-macos/
	- https://gizmodo.com/apple-and-nvidia-are-over-1840015246
				</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>cuda_os_ver</key>
				<string>%MAJOR_OS_VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>CUDADriverURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/CUDADriver.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: NVIDIA Corporation (6KR3T733EC)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
