<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports MOOS Project Viewer into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jessepeterson.MOOSProjectViewer.munki</string>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.MOOSProjectViewer.download</string>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MOOSProjectViewer</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>MOOS Project Viewer is a viewer for Microsoft® Project that allows you to open, view in a dynamic way and print any Microsoft® Project file. It is running on any Java enabled platform including Windows®, Mac OS X and Linux.</string>
			<key>display_name</key>
			<string>MOOS Project Viewer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
