<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest dockutil.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jessepeterson.download.dockutil</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>dockutil</string>
        <key>DOCKUTIL_URL</key>
        <string>https://raw.github.com/kcrawford/dockutil/master/scripts/dockutil</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOCKUTIL_URL%</string>
                <key>re_pattern</key>
                <string>version\s=\s&apos;(?P&lt;version&gt;[0-9\.]*)&apos;</string>
            </dict>		
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOCKUTIL_URL%</string>
                <key>filename</key>
                <string>%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
